project/atropos-c/cases/mysql-cases/concurrency-case/front_1/parties-2.log
sysbench 1.1.0-f698960 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 1.000000 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1.0s ] thds: 4 tps: 16.94 qps: 404.60 (r/w/o: 292.98/73.74/37.87) lat (ms,95%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 2.0s ] thds: 4 tps: 20.01 qps: 400.26 (r/w/o: 276.18/84.05/40.03) lat (ms,95%): 977.74 err/s: 0.00 reconn/s: 0.00
[ 3.0s ] thds: 4 tps: 60.01 qps: 1186.11 (r/w/o: 836.08/230.02/120.01) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 4.0s ] thds: 4 tps: 79.77 qps: 1611.34 (r/w/o: 1124.74/327.05/159.54) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 5.0s ] thds: 4 tps: 84.07 qps: 1648.41 (r/w/o: 1151.98/328.28/168.14) lat (ms,95%): 73.13 err/s: 0.00 reconn/s: 0.00
[ 6.0s ] thds: 4 tps: 54.90 qps: 1109.91 (r/w/o: 780.53/219.59/109.79) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 7.0s ] thds: 4 tps: 66.26 qps: 1321.19 (r/w/o: 923.63/265.04/132.52) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 8.0s ] thds: 4 tps: 50.80 qps: 1036.90 (r/w/o: 727.13/208.18/101.60) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 9.0s ] thds: 4 tps: 58.23 qps: 1166.54 (r/w/o: 815.17/234.91/116.45) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 10.0s ] thds: 4 tps: 55.96 qps: 1116.11 (r/w/o: 783.38/220.82/111.91) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 11.0s ] thds: 4 tps: 66.05 qps: 1315.05 (r/w/o: 918.74/264.21/132.11) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 12.0s ] thds: 4 tps: 41.84 qps: 839.75 (r/w/o: 592.71/163.37/83.68) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 13.0s ] thds: 4 tps: 66.26 qps: 1313.09 (r/w/o: 911.53/269.04/132.51) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 14.0s ] thds: 4 tps: 59.77 qps: 1211.31 (r/w/o: 852.70/239.07/119.54) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 15.0s ] thds: 4 tps: 64.00 qps: 1267.08 (r/w/o: 882.05/258.02/127.01) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 16.0s ] thds: 4 tps: 53.15 qps: 1056.03 (r/w/o: 742.13/206.59/107.31) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 17.0s ] thds: 4 tps: 65.81 qps: 1335.07 (r/w/o: 937.24/266.22/131.61) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 18.0s ] thds: 4 tps: 54.00 qps: 1067.02 (r/w/o: 743.01/216.00/108.00) lat (ms,95%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 19.0s ] thds: 4 tps: 47.00 qps: 948.96 (r/w/o: 663.97/190.99/94.00) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 20.0s ] thds: 4 tps: 35.00 qps: 672.99 (r/w/o: 467.99/135.00/70.00) lat (ms,95%): 97.55 err/s: 0.00 reconn/s: 0.00
[ 21.0s ] thds: 4 tps: 46.14 qps: 950.81 (r/w/o: 667.97/190.56/92.27) lat (ms,95%): 657.93 err/s: 0.00 reconn/s: 0.00
[ 22.0s ] thds: 4 tps: 63.84 qps: 1274.77 (r/w/o: 891.74/255.35/127.68) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 23.0s ] thds: 4 tps: 69.98 qps: 1388.59 (r/w/o: 972.71/275.92/139.96) lat (ms,95%): 112.67 err/s: 0.00 reconn/s: 0.00
[ 24.0s ] thds: 4 tps: 57.07 qps: 1159.32 (r/w/o: 813.93/231.26/114.13) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 25.0s ] thds: 4 tps: 62.08 qps: 1228.56 (r/w/o: 858.09/246.31/124.16) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 26.0s ] thds: 4 tps: 50.91 qps: 1011.23 (r/w/o: 709.76/199.65/101.82) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 27.0s ] thds: 4 tps: 45.11 qps: 915.28 (r/w/o: 644.60/180.45/90.22) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 28.0s ] thds: 4 tps: 50.03 qps: 989.62 (r/w/o: 689.43/200.12/100.06) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 29.0s ] thds: 4 tps: 36.87 qps: 740.45 (r/w/o: 515.22/151.48/73.75) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 30.0s ] thds: 4 tps: 48.16 qps: 963.18 (r/w/o: 676.23/190.63/96.32) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 31.0s ] thds: 4 tps: 37.95 qps: 764.08 (r/w/o: 534.36/153.82/75.91) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 32.0s ] thds: 4 tps: 46.02 qps: 924.31 (r/w/o: 650.22/182.06/92.03) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 33.0s ] thds: 4 tps: 41.02 qps: 807.31 (r/w/o: 563.22/162.06/82.03) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 34.0s ] thds: 4 tps: 51.94 qps: 1050.79 (r/w/o: 734.15/212.75/103.88) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 35.0s ] thds: 4 tps: 46.04 qps: 921.72 (r/w/o: 647.51/182.14/92.07) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 36.0s ] thds: 4 tps: 43.04 qps: 851.85 (r/w/o: 589.59/176.18/86.09) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 37.0s ] thds: 4 tps: 44.94 qps: 893.79 (r/w/o: 631.14/172.77/89.88) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 38.0s ] thds: 4 tps: 44.99 qps: 924.78 (r/w/o: 642.85/191.95/89.98) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 39.0s ] thds: 4 tps: 45.07 qps: 888.41 (r/w/o: 624.99/173.27/90.14) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 40.0s ] thds: 4 tps: 46.99 qps: 940.73 (r/w/o: 657.81/188.95/93.97) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 41.0s ] thds: 4 tps: 46.91 qps: 939.24 (r/w/o: 655.77/189.64/93.82) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 42.0s ] thds: 4 tps: 43.97 qps: 863.37 (r/w/o: 607.56/167.88/87.94) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 43.0s ] thds: 4 tps: 49.05 qps: 981.95 (r/w/o: 687.66/196.19/98.09) lat (ms,95%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 44.0s ] thds: 4 tps: 38.05 qps: 762.91 (r/w/o: 529.64/157.19/76.09) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 45.0s ] thds: 4 tps: 49.04 qps: 980.84 (r/w/o: 691.59/191.16/98.08) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 46.0s ] thds: 4 tps: 44.00 qps: 902.99 (r/w/o: 629.99/185.00/88.00) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 47.0s ] thds: 4 tps: 46.86 qps: 923.31 (r/w/o: 645.12/184.46/93.73) lat (ms,95%): 183.21 err/s: 0.00 reconn/s: 0.00
[ 48.0s ] thds: 4 tps: 35.98 qps: 731.56 (r/w/o: 512.69/146.91/71.96) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 49.0s ] thds: 4 tps: 35.01 qps: 685.18 (r/w/o: 481.12/134.03/70.02) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 50.0s ] thds: 4 tps: 43.14 qps: 866.73 (r/w/o: 609.92/170.54/86.27) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 51.0s ] thds: 4 tps: 52.98 qps: 1059.70 (r/w/o: 742.79/210.94/105.97) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 52.0s ] thds: 4 tps: 36.96 qps: 755.13 (r/w/o: 521.40/159.82/73.91) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 53.0s ] thds: 4 tps: 43.00 qps: 844.01 (r/w/o: 588.01/170.00/86.00) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 54.0s ] thds: 4 tps: 43.95 qps: 887.99 (r/w/o: 627.29/172.80/87.90) lat (ms,95%): 350.33 err/s: 0.00 reconn/s: 0.00
[ 55.0s ] thds: 4 tps: 44.95 qps: 892.91 (r/w/o: 627.23/175.79/89.89) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 56.0s ] thds: 4 tps: 51.00 qps: 1014.98 (r/w/o: 710.99/202.00/102.00) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 57.0s ] thds: 4 tps: 33.12 qps: 675.54 (r/w/o: 469.77/139.52/66.25) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 58.0s ] thds: 4 tps: 24.91 qps: 486.17 (r/w/o: 342.71/93.65/49.81) lat (ms,95%): 623.33 err/s: 0.00 reconn/s: 0.00
[ 59.0s ] thds: 4 tps: 46.13 qps: 935.54 (r/w/o: 652.77/190.52/92.25) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 60.0s ] thds: 4 tps: 46.93 qps: 931.67 (r/w/o: 653.06/184.74/93.87) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 61.0s ] thds: 4 tps: 31.04 qps: 599.75 (r/w/o: 412.51/125.16/62.08) lat (ms,95%): 356.70 err/s: 0.00 reconn/s: 0.00
[ 62.0s ] thds: 4 tps: 52.99 qps: 1067.75 (r/w/o: 755.82/205.95/105.97) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 63.0s ] thds: 4 tps: 34.01 qps: 680.23 (r/w/o: 472.16/140.05/68.02) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 64.0s ] thds: 4 tps: 50.87 qps: 1017.34 (r/w/o: 712.14/203.47/101.73) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 65.0s ] thds: 4 tps: 42.14 qps: 854.78 (r/w/o: 601.96/168.55/84.27) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 66.0s ] thds: 4 tps: 42.86 qps: 862.12 (r/w/o: 603.98/172.42/85.71) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 67.0s ] thds: 4 tps: 36.14 qps: 705.75 (r/w/o: 488.90/144.56/72.28) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 68.0s ] thds: 4 tps: 34.00 qps: 690.03 (r/w/o: 487.02/135.00/68.00) lat (ms,95%): 297.92 err/s: 0.00 reconn/s: 0.00
[ 69.0s ] thds: 4 tps: 47.82 qps: 948.38 (r/w/o: 661.47/191.27/95.63) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 70.0s ] thds: 4 tps: 37.13 qps: 746.58 (r/w/o: 520.80/151.52/74.26) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 71.0s ] thds: 4 tps: 50.01 qps: 1009.29 (r/w/o: 710.20/199.06/100.03) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 72.0s ] thds: 4 tps: 40.85 qps: 808.95 (r/w/o: 566.86/160.40/81.69) lat (ms,95%): 227.40 err/s: 0.00 reconn/s: 0.00
[ 73.0s ] thds: 4 tps: 51.16 qps: 1028.17 (r/w/o: 719.22/206.64/102.32) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 74.0s ] thds: 4 tps: 41.94 qps: 829.87 (r/w/o: 578.21/167.77/83.89) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 75.0s ] thds: 4 tps: 51.91 qps: 1041.25 (r/w/o: 730.77/206.65/103.83) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 76.0s ] thds: 4 tps: 47.10 qps: 952.03 (r/w/o: 663.41/194.41/94.20) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 77.0s ] thds: 4 tps: 46.08 qps: 908.49 (r/w/o: 638.05/178.29/92.15) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 78.0s ] thds: 4 tps: 37.00 qps: 737.01 (r/w/o: 519.01/144.00/74.00) lat (ms,95%): 331.91 err/s: 0.00 reconn/s: 0.00
[ 79.0s ] thds: 4 tps: 56.97 qps: 1134.35 (r/w/o: 790.55/229.87/113.94) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 80.0s ] thds: 4 tps: 42.02 qps: 857.41 (r/w/o: 606.29/167.08/84.04) lat (ms,95%): 176.73 err/s: 0.00 reconn/s: 0.00
[ 81.0s ] thds: 4 tps: 49.99 qps: 985.81 (r/w/o: 686.86/198.96/99.98) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 82.0s ] thds: 4 tps: 47.98 qps: 963.68 (r/w/o: 672.77/194.93/95.97) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 83.0s ] thds: 4 tps: 49.99 qps: 1003.75 (r/w/o: 706.82/196.95/99.98) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 84.0s ] thds: 4 tps: 48.89 qps: 988.80 (r/w/o: 689.47/201.55/97.78) lat (ms,95%): 137.35 err/s: 0.00 reconn/s: 0.00
[ 85.0s ] thds: 4 tps: 37.97 qps: 750.50 (r/w/o: 524.65/149.90/75.95) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 86.0s ] thds: 4 tps: 39.00 qps: 775.98 (r/w/o: 543.98/154.00/78.00) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 87.0s ] thds: 4 tps: 49.99 qps: 1000.88 (r/w/o: 697.91/202.98/99.99) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 88.0s ] thds: 4 tps: 44.00 qps: 886.01 (r/w/o: 625.01/173.00/88.00) lat (ms,95%): 314.45 err/s: 0.00 reconn/s: 0.00
[ 89.0s ] thds: 4 tps: 50.17 qps: 992.41 (r/w/o: 691.37/200.69/100.34) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 90.0s ] thds: 4 tps: 40.02 qps: 803.35 (r/w/o: 558.24/165.07/80.04) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            59780
        write:                           17080
        other:                           8540
        total:                           85400
    transactions:                        4270   (47.41 per sec.)
    queries:                             85400  (948.20 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      47.4099
    time elapsed:                        90.0656s
    total number of events:              4270

Latency (ms):
         min:                                   25.27
         avg:                                   84.33
         max:                                 1808.27
         95th percentile:                      186.54
         sum:                               360104.03

Threads fairness:
    events (avg/stddev):           1067.5000/12.11
    execution time (avg/stddev):   90.0260/0.03